add initial version of nodes/edges + composers
